---
kind: type
id: T:Autodesk.Revit.DB.Electrical.DistributionSysTypeSet
source: html/4e94a9fd-aaec-b38b-5d67-edac1ed07d50.htm
---
# Autodesk.Revit.DB.Electrical.DistributionSysTypeSet

A set that contains DistributionSys types.

## Syntax (C#)
```csharp
public class DistributionSysTypeSet : APIObject,
	IEnumerable
```